{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["hi", "hello", "hey", "greetings", "good morning", "good afternoon", "good evening"],
      "responses": ["Hello! How can I assist you today?", "Hi there! What can I help you with?", "Welcome! How may I assist you?", "Hey! How can I help you today?"]
    },
    {
      "tag": "farewell",
      "patterns": ["bye", "goodbye", "see you later", "see you soon"],
      "responses": ["Goodbye! Have a great day.", "See you later!", "Take care!"]
    },
    {
      "tag": "thankyou",
      "patterns": ["thanks", "thank you", "appreciate it"],
      "responses": ["You're welcome!", "My pleasure.", "No problem."]
    },
    {
      "tag":"BRP",
       "patterns": ["BRP","biometric residence permit card","How do I collect my biometric residence permit card (BRP) from the Post Office", "Post Office","Can you please guide me on the process of collecting my biometric residence permit card (BRP) from the Post Office?"],
       "responses": ["You must collect your BRP within 10 days of your arrival in the UK; this can be done at the allocated post office. You will need to bring your decision letter and 90-day vignette. Failure to collect your BRP within the specified period will result in a civil penalty and/or a fine and your visa may be cancelled", "It is imperative to ensure the retrieval of your Biometric Residence Permit (BRP) within a time frame of 10 days subsequent to your arrival in the United Kingdom. This obligatory task can be accomplished at the designated post office assigned for this purpose. To facilitate the process, it is essential to bring along your decision letter and the 90-day vignette. Failing to adhere to the prescribed timeframe for BRP collection may incur a civil penalty and/or a fine, and may also lead to the cancellation of your visa.", "It is imperative that you retrieve your Biometric Residence Permit (BRP) within a span of 10 days upon your arrival in the United Kingdom. This task can be accomplished at the designated post office. It is necessary for you to carry your decision letter as well as the 90-day vignette. Neglecting to collect your BRP within the stipulated timeframe shall incur a civil penalty and/or a fine, and may lead to the cancellation of your visa."] 
    },
     {
      "tag":"enrolment",
       "patterns":["enrolment","documents","What documents do I need to complete my enrolment upon arrival",
                  "May I know the list of documents required for me to finish my enrolment process upon my arrival",
                  "Kindly advise on the requisite documents that I am required to present in order to complete my enrolment upon arrival"],
        "responses": ["To complete the enrolment task, you should upload the following documents: \n *A copy of the photo page of your passport* \n *A copy of the front and back of your Biometric Residence Permit (BRP). If you do not have your BRP yet, please upload a copy of your UKVI collection letter.* \n *A copy of your 90-day transit visa.*","In order to fulfill the enrolment requirements, it is necessary for you to upload the following documents: \n *A photocopy of the photo page of your passport.* \n *A photocopy of both the front and back sides of your Biometric Residence Permit (BRP). If you have not received your BRP yet, kindly upload a copy of your UKVI collection letter.* \n *A photocopy of your 90-day transit visa.*","In order to fulfill the enrollment requirement, it is necessary to submit the following documents: \n *A duplicate of the photo page of your passport.*  \n *Copies of both the front and back of your Biometric Residence Permit (BRP). If you have not yet received your BRP, please provide a copy of your UKVI collection letter.* \n *A copy of your 90-day transit visa.*"]},
      {
        "tag":"NIN",
         "patterns":["NIN","National Insurance Number"," How do I apply for a National Insurance Number (NIN)?","Could you please guide me through the process of applying for a National Insurance Number (NIN)",
                 "May I inquire as to the formal procedure for applying for a National Insurance Number (NIN)"],
          "responses": ["You can apply for a National Insurance number online on the UK Government website. You will be asked to prove your identity by uploading one or more of the following documents during the application process: \n *A passport from any country* \n *A biometric residence permit (BRP)* \n *A national identity card from an EU country or from Norway, Liechtenstein or Switzerland*","One can submit an application for a National Insurance number through the official website of the United Kingdom Government. Throughout the application procedure, it will be necessary to substantiate one's identity by electronically uploading one or more of the subsequent documents: \n *Any passport issued by a country* \n *A biometric residence permit (BRP)* \n *A national identity card originating from a European Union member state or from Norway, Liechtenstein, or Switzerland.*","To initiate the application process for a National Insurance number in the United Kingdom, it is possible to utilize the online platform provided by the UK Government. As part of the application procedure, individuals are required to substantiate their identity by electronically submitting one or more of the subsequent documents: \n *A valid passport issued by any country.* \n *A biometric residence permit (BRP).* \n *A national identity card issued by a European Union (EU) country, Norway, Liechtenstein, or Switzerland.*"]
      },
      {
        "tag":"Northumbria WiFi",
         "patterns":["Northumbria WiFi","How do I access Northumbria WiFi on my mobile devices while on campus",
                     "To connect to Northumbria Wi-Fi using your mobile devices while on campus, what steps should I follow","To access Northumbria Wi-Fi on your mobile devices while on campus, could you please provide guidance on the steps to follow"],
         "responses":["While on campus you can connect to the NU Simply Web wireless network on your Smartphone using your northumbria user name and password.", "While on campus, you have the option to access the NU Simply Web wireless network on your smartphone by utilizing your Northumbria username and password.","Whilst on campus, you have the capability to establish a connection with the NU Simply Web wireless network on your Smartphone by utilizing your Northumbria username and password."]
      },
      {
        "tag":"Blackboard",
         "patterns":["Blackboard","Where and how do I get started with Blackboard?"," get started with Blackboard"],
         "responses": ["To access Blackboard: \n **On campus:** Use the desktop shortcut to open Blackboard through Google Chrome \n  **Off campus:** Open a Google Chrome web browser and go to *elp.northumbria.ac.uk \n How do I access my academic timetable? \nIf you are a new student, we recommend you view your timetable through the NU Connect App in the first instance. You would need your Northumbria username and password to sign up. \nNU Connect runs on both Apple and Android ","To access Blackboard: \n **On campus:** Employ the desktop shortcut to initiate Blackboard via Google Chrome. \n **Off campus:*** Launch a Google Chrome web browser and navigate to *elp.northumbria.ac.uk. \n How can I access my academic timetable? \n For new students, we advise utilizing the NU Connect App as the primary method to review your timetable. To register, you will require your Northumbria username and password. \n NU Connect is compatible with both Apple and Android devices.","To access Blackboard, follow these steps: \n If you are on campus, use the desktop shortcut to open Blackboard through Google Chrome. \n If you are off campus, open a Google Chrome web browser and navigate to *elp.northumbria.ac.uk. \n To access your academic timetable, we recommend the following: \n If you are a new student, it is best to view your timetable through the NU Connect App initially. \n Download the NU Connect App on your Apple or Android device. \n Sign up using your Northumbria username and password. \n Once logged in, you will be able to access your academic timetable through the app."]
      },
      {
        "tag":"time table",
         "patterns": ["academic time table","time table","How do I access my academic time table","How can I view my academic timetable"],
         "responses":["If you are a new student, we recommend you view your timetable through the NU Connect App in the first instance. NU Connect runs on both Apple and Android - visit your App Store now. Apple Store and Google Play. \n When you first open NU Connect you’ll be prompted to login. Please enter the following information: \n **Email:** Your Northumbria username + @northumbria.ac.uk e.g. w12345678@northumbria.ac.uk \n **Password:** Your Northumbria password. This is the same password you use to logon to Northumbria University IT facilities such as the Student Desktop or Blackboard \n You shouldn’t need to enter these details again unless you reinstall the app or tap the Logout button.","For new students, we recommend accessing your timetable through the NU Connect App initially. The NU Connect App is available on both Apple and Android platforms, which can be downloaded from the Apple Store and Google Play, respectively. Upon launching the NU Connect App, you will be asked to log in using the following information: \n **Email:** Your Northumbria username followed by @northumbria.ac.uk (e.g., w12345678@northumbria.ac.uk) \n **Password:** Your Northumbria password, which is the same password you use for accessing other Northumbria University IT facilities like the Student Desktop or Blackboard. You should not need to enter this information again unless you uninstall the app / log out"]
      },
      {
        "tag":" student visa",
         "patterns":[" student visa","What are the rules around working on a student visa",
                    "What are the regulations concerning employment on a student visa"],
         "responses":["Your work conditions will be written on your Entry Clearance vignette or Biometric Residence Permit (BRP). Students can work full time during university vacation periods. These are official periods and not dependant on when you may think your work/study is complete. \n During term time, international students studying at degree or above degree level can work for 20 hours per week. \n Students in receipt of a University studentship (PGR) are permitted to work a maximum of 6 hours per week except during their 8-week vacation period when full-time work is permitted Work during vacation periods","Your work conditions will be specified on either your Entry Clearance vignette or Biometric Residence Permit (BRP). International students can work full-time during official university vacation periods, regardless of the completion of their work or studies. However, during term time, international students studying at the degree level or above are allowed to work for up to 20 hours per week. If you are a student receiving a University studentship (PGR), you can work a maximum of 6 hours per week, except during your 8-week vacation period when full-time work is permitted.","The details regarding your work conditions shall be specified upon your Entry Clearance vignette or Biometric Residence Permit (BRP). It is pertinent to note that students are allowed to engage in full-time employment exclusively during the designated university vacation periods. These periods are officially determined and are not contingent upon the completion of your academic obligations. \n Throughout the academic term, international students pursuing a degree or postgraduate degree are permitted to work for a maximum of 20 hours per week. However, students who are recipients of a University studentship (PGR) are only authorized to work for a maximum of 6 hours per week, with the exception of their 8-week vacation period when full-time employment is admissible. \n Therefore, it is essential to be mindful of the stipulations concerning work opportunities during vacation periods."]
      },
      {
         "tag":"Work letter",
          "patterns": ["Work letter","Conditions of Work letter","How do I generate a Conditions of Work letter"],
          "responses": ["To generate your letter a Conditions of Work letter, follow the steps below: \n *Log into the evision student portal with your username and password* \n *Select the 'Menu' button at the top of the screen and click on the ‘Letter Requests’ link \n *Click on 'Generate Letter' in the ‘Conditions of work’ area* \n *Confirmation of Semester dates and vacation periods*","To generate a Conditions of Work letter, kindly proceed with the following steps:\n • Access the evision student portal by logging in with your assigned username and password. \n• Locate the 'Menu' button positioned at the top of the screen and proceed to select the 'Letter Requests' link. \n • Within the designated 'Conditions of Work' section, click on the option labeled 'Generate Letter'. \n • You will receive confirmation regarding the semester dates and vacation periods." ]
        },
      {
       "tag": "Skills module",
        "patterns": ["Skills module","Academic Language Skills module",". As an international student, can I be removed from the Academic Language Skills module","Could I be withdrawn from the Academic Language Skills module as an international student"],
         "responses":["Demonstration of academic language skills above a required standard in an exemption test will qualify you to be removed from the module if you wish. Your Academic Language Skills Module Tutor will inform you about this exemption test at the beginning of the module. Please attend the module as scheduled until you have been granted exemption.","Demonstrating superior academic language skills in an exemption examination shall warrant your eligibility for withdrawal from the module, should you so desire. Your esteemed Academic Language Skills Module Tutor shall apprise you of said exemption examination at the commencement of the module. We kindly request your presence in the module as planned until exemption has been duly granted.","As an international student, you may opt to take an exemption test if you feel confident in your academic language skills without the support of the Academic Language Skills module. If you demonstrate academic language skills above a required standard in this test, you may be exempted from the module. Your Academic Language Skills Module Tutor will provide information about the exemption test at the start of the module, and it is important that you attend all scheduled classes until you have been granted exemption.","The successful demonstration of superior academic language skills through an exemption test will enable your removal from the module, should you choose to do so. Your Academic Language Skills Module Tutor will provide you with information regarding the exemption test at the module's commencement. It is imperative that you continue attending the module as scheduled until you have received official exemption approval."]
      },
      {
       "tag": "Tax letter",
        "patterns":["Tax letter","Requesting a Council Tax letter","Procedure for Requesting a Council Tax Letter"],
         "responses":["To qualify for a student discount or exemption you will need to upload a student council tax exemption certificate or equivalent written confirmation from the educational establishmentFollow the steps below to generate a letter of examption \n Log into the evision student portal with your username and password \n Select 'My Requests' at the top of the screen and click on the 'Letter Requests' link \n Click on 'Generate Letter' in the 'Council Tax Certificate' area","To be eligible for a student discount or exemption, you must provide a student council tax exemption certificate or an official written confirmation from your educational institution. To generate a letter of exemption, please follow these steps precisely:\n Access the evision student portal using your assigned username and password. \n Locate and select the 'My Requests' option at the top of the screen. \n Click on the 'Letter Requests' link within the 'My Requests' section. \n In the 'Council Tax Certificate' area, locate and click on the 'Generate Letter' button. \n By following these instructions accurately, you will be able to generate the required letter of exemption.","To be eligible for a student discount or exemption, you'll be needing to upload a student council tax exemption certificate or an equivalent written confirmation from the educational institution. Follow the steps below to create a letter of exemption: \n Log in to the evision student portal using your username and password. \n Choose 'My Requests' located at the top of the screen and click on the 'Letter Requests' link.\n Proceed to 'Generate Letter' within the 'Council Tax Certificate' section."]
      },
      {
        "tag":"students accommodation",
         "patterns": ["How do I apply for student accommodation","student accomodation","apply for student accommodation"],
         "responses":["You can apply for accommodation directly within the Student Portal. On your Student Portal dashboard, click on the Accommodation widget and log in Select the application period you want to apply ", "You can apply for accommodation directly within the Student Portal. On your Student Portal dashboard, simply click on the Accommodation widget and log in. Choose the application period you wish to apply for, old chap!","To initiate the accommodation application process, kindly access the Student Portal. Within the dashboard of your Student Portal, locate and click on the designated widget for Accommodation. Following this, proceed to log in to your account. From there, you will be presented with the option to select the desired application period for your accommodation application."]
      },
      {
        "tag":"change",
         "patterns": ["change of circumstance","changing programme","leaving University","What to do if you are considering a change of circumstance such as changing programme, taking time out or thinking of leaving University"],
         "responses":["In all cases, you should contact your Programme Leader or Personal Tutor first, as soon as possible to let them know you are having difficulties, and that you are considering one of the above options. Your Programme Leader or Personal Tutor can help you determine whether these options are right for you, and help you make an informed choice about what to do next. ", "In every instance, it is imperative that you promptly notify your Programme Leader or Personal Tutor about your challenges and your contemplation of the aforementioned alternatives. By doing so, your Programme Leader or Personal Tutor will be able to assist you in assessing the appropriateness of these options for your circumstances and guide you in making a well-informed decision regarding your next course of action.", "In every instance, it is imperative that you promptly reach out to your Programme Leader or Personal Tutor as your initial point of contact. Inform them about the challenges you are facing and express your contemplation of the aforementioned alternatives. Your Programme Leader or Personal Tutor possesses the necessary expertise to assist you in assessing the suitability of these options for your circumstances and to aid you in making an informed decision regarding your next course of action."]
      },
      {
        "tag":"smart card",
         "patterns": ["smart card","How do I register my attendance if I forget my smart card","What is the process for registering my attendance if I have forgotten my smart card"],
          "responses":["If you forget your Smartcard, you can register your attendance electronically via My Attendance from the main menu in your Student Portal, or through the NU Connect App (My Learning > My Attendance).","If you forget your Smartcard, you can register your attendance electronically via My Attendance from the main menu in your Student Portal, or through the NU Connect App (My Learning > My Attendance)."]
      }
  
]
}
